from aiogram.types.message import ContentType
from aiogram import types

from pathlib import Path


admin_password = '_bogdan_'
admin_id = ['751853472', '1447353916']

path_to_driver = str(Path(str(Path.home()), 'Desktop', 'geckodriver.exe'))

categories = [
    'Женщинам',
    'Обувь',
    'Мужчинам',
    'Дом',
    'Красота',
    'Аксессуары',
    'Электроника',
    'Игрушки',
    'Мебель',
    '18+',
    'Продукты',
    'Быт. тех.',
    'Зоотовары',
    'Спорт',
    'Автотовары',
    'Школа',
    'Книги',
    'Ювелирка',
    'Для ремонта',
    'Сад и дача',
    'Здоровье',
    'Канцтовары'
]



category_id = {
    'Женщинам': '1',
    'Обувь': '2',
    'Мужчинам': '3',
    'Дом': '4',
    'Красота': '5',
    'Аксессуары': '6',
    'Электроника': '7',
    'Игрушки': '8',
    'Мебель': '9',
    '18+': '10',
    'Продукты': '11',
    'Быт. тех.': '12',
    'Зоотовары': '13',
    'Спорт': '14',
    'Автотовары': '15',
    'Школа': '16',
    'Книги': '17',
    'Ювелирка': '18',
    'Для ремонта': '19',
    'Сад и дача': '20',
    'Здоровье': '21',
    'Канцтовары': '22'
}


count_browser = 2
count_pool = 6
count_send = 5
sub_days = 7

PAYMENTS_TOKEN = '390540012:LIVE:27870'






